demoscenario.yaml
---

reporting:
- module: passfail
  criteria:
  - avg-rt of Select flight>1000ms for 3s, stop as failed
  - fail of Confirmation>0%, stop as failed


# Script generated by Blazemeter Chrome Extension

execution:
- executor: jmeter
  scenario: Demo Scenario
  concurrency: 10
  ramp-up: 15s
  hold-for: 2m

scenarios:

  Demo Scenario:

    headers:
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
      Accept-Encoding: 'gzip, deflate'
      Accept-Language: 'en-US,en;q=0.9'

    requests:

      - transaction: Select flight
        do:
          - url: 'http://blazedemo.com/reserve.php'
            method: POST
            label: 'Reserve'
            think-time: 0ms
            headers:
              Referer: 'http://blazedemo.com/'
            body:
              fromPort: Paris
              toPort: Buenos Aires
          - url: 'http://blazedemo.com/purchase.php'
            method: POST
            label: 'Purchase'
            think-time: 6683ms
            headers:
              Referer: 'http://blazedemo.com/reserve.php'
            body:
              airline: Virgin America
              flight: '43'
              fromPort: Paris
              price: '472.56'
              toPort: Buenos Aires

      - transaction: Book flight
        do:
          - url: 'http://blazedemo.com/confirmation.php'
            method: POST
            label: 'Confirmation'
            think-time: 18842ms
            headers:
              Referer: 'http://blazedemo.com/purchase.php'
            body:
              _token: ''
              address: 123 Main Street
              cardType: visa
              city: Anytown
              creditCardMonth: '11'
              creditCardNumber: ''
              creditCardYear: '2017'
              inputName: Klaus Neuhold
              nameOnCard: ''
              state: State
              zipCode: '12345'