demoscenario.yaml
# What to test
scenarios:
  Demo Scenario:
    requests:

      - label: 'Search flight'
        url: 'http://blazedemo.com/reserve.php'
        method: POST
        headers:
          Content-Type: application/x-www-form-urlencoded
        body:
          fromPort: Paris
          toPort: Buenos Aires

      - label: 'Select flight'
        url: 'http://blazedemo.com/purchase.php'
        method: POST
        headers:
          Content-Type: application/x-www-form-urlencoded
        body:
          airline: Virgin America
          flight: '43'
          fromPort: Paris
          price: '472.56'
          toPort: Buenos Aires

      - label: 'Book flight'
        url: 'http://blazedemo.com/confirmation.php'
        method: POST
        body:
          address: 123 Main Street
          cardType: visa
          city: Anytown
          creditCardMonth: '11'
          creditCardNumber: '123123123123123'
          creditCardYear: '2017'
          inputName: Klaus Neuhold
          state: State
          zipCode: '12345'

# How to run the test
execution:
- executor: jmeter
  scenario: Demo Scenario
  concurrency: 10
  ramp-up: 10s
  hold-for: 15s

# When to fail the test
reporting:
- module: passfail
  criteria:
     - avg-rt of Select flight>5550ms for 3s, stop as failed
    #- fail of Confirmation>0%, stop as failed